#+TITLE: VRP generate-solution
#+AUTHOR: Alejandra Monzon Penna
#+AUTHOR: Gabriela Arguelles Terron

*** Test

#+BEGIN_SRC lisp :results output 

  (format t "Make-clients: ~a~%" (make-clients))
  (format t "Make-clients with max: ~a~%" (make-clients 20))
  (format t "Make-routes: ~a~%" (make-routes (make-clients)))
  (format t "Power-set: ~a~%" (power-set '(1 2 3 4 5)))


#+END_SRC

#+RESULTS:
: Make-clients: (1 2 3)
: Make-clients with max: (1 2 3 4 5 6 7 8 9 10 11 12 13)
: Make-routes: ((2 1))
: Power-set: ((1 2 3 4 5) (1 2 3 4) (1 2 3 5) (1 2 3) (1 2 4 5) (1 2 4) (1 2 5)
:             (1 2) (1 3 4 5) (1 3 4) (1 3 5) (1 3) (1 4 5) (1 4) (1 5) (1)
:             (2 3 4 5) (2 3 4) (2 3 5) (2 3) (2 4 5) (2 4) (2 5) (2) (3 4 5)
:             (3 4) (3 5) (3) (4 5) (4) (5) NIL)


***** TEST


#+BEGIN_SRC lisp :results output
  (progn

   (defclass test-1-description (visit-each-client-at-least-once) ())

   (defclass test-1-ps (has-clients has-routes) ())

  (Generate-solution-by-condition (make-instance 'test-1-description) (make-instance 'basic-strategy) (make-instance 'test-1-ps)))

#+END_SRC

#+RESULTS:
: IN Main method
: IN visit-each-client-at-least-once
: clients: (1 2 3 4 5 6)
: routes: ((2) (1 4 3 5 6))


***** TEST

#+BEGIN_SRC lisp :results output
  (progn
   (defclass test-2-description (visit-client-at-most-once) ())

   (defclass test-2-ps (has-clients has-routes) ())

  (Generate-solution-by-condition (make-instance 'test-2-description) (make-instance 'basic-strategy) (make-instance 'test-2-ps) t))

#+END_SRC

#+RESULTS:
: IN Main method
: IN  visit-client-at-most-once
: IN Main method
: IN visit-each-client-at-least-once
: clients: (1 2 3 4 5 6 7)
: routes: ((1 3 4 5) (7 6) (2))


***** TEST

#+BEGIN_SRC lisp :results output
  (progn

   (defclass test-3-description (begin-in-depot) ())

   (defclass test-3-ps (has-clients has-routes) ())

  (Generate-solution-by-condition (make-instance 'test-3-description) (make-instance 'basic-strategy) (make-instance 'test-3-ps)))

#+END_SRC

#+RESULTS:
: IN Main method
: IN  begin-in-depot
: IN Main method
: IN visit-each-client-at-least-once
: clients: (1 2 3 4 5 6)
: routes: ((2) (3) (1 6 5 4))
: routes brgin in depot: ((0 2) (0 3) (0 1 6 5 4))


***** TEST

#+BEGIN_SRC lisp :results output
  (progn

   (defclass test-3-description (end-in-depot) ())

   (defclass test-3-ps (has-clients has-routes) ())

  (Generate-solution-by-condition (make-instance 'test-3-description) (make-instance 'basic-strategy) (make-instance 'test-3-ps)))

#+END_SRC

#+RESULTS:
: IN Main method
: IN end-in-depot
: IN Main method
: IN visit-each-client-at-least-once
: clients: (1 2 3 4 5 6 7 8 9 10 11 12)
: routes: ((7 3 4 10) (2) (11 8 9) (12) (6) (1) (5))
: routes end in depot: ((7 3 4 10 0) (2 0) (11 8 9 0) (12 0) (6 0) (1 0) (5 0))

***** TEST

#+BEGIN_SRC lisp :results output
  (progn
    (defclass test-4-description (dont-overload-vehicle) ())

   (defclass test-4-ps (has-clients has-routes has-demand has-capacity) ())

  (Generate-solution-by-condition (make-instance 'test-4-description) (make-instance 'basic-strategy) (make-instance 'test-4-ps)))

#+END_SRC

#+RESULTS:
#+begin_example
IN Main method
IN dont-overload-vehicle
IN Main method
IN visit-each-client-at-least-once
clients: (1 2 3 4 5 6 7 8 9 10 11 12 13)
routes: ((8 7 4 9 2 13 1 3 10 6 5 11 12))
demands: (0 96 40 88 3 15 39 56 39 76 61 85 81 31)
values: (710)
max value: 710
capacity: 717
#+end_example



***** TEST

#+BEGIN_SRC lisp :results output
  (progn

  (defclass test-5-description (dont-visit-each-client-at-least-once) ())

  (defclass test-5-ps (has-clients has-routes) ())

  (Generate-solution-by-condition (make-instance 'test-5-description) (make-instance 'basic-strategy) (make-instance 'test-5-ps)))

#+END_SRC

#+RESULTS:
: IN Main method
: IN dont-visit-each-client-at-least-once
: clients: (1 2 3 4 5 6 7 8 9 10 11 12)
: routes: ((2 4 11) (6 9) (10 3 1 8) (5))



***** TEST

#+BEGIN_SRC lisp :results output
  (progn

  (defclass test-6-description (visit-client-more-than-once) ())

  (defclass test-6-ps (has-clients has-routes) ())

  (Generate-solution-by-condition (make-instance 'test-6-description) (make-instance 'basic-strategy) (make-instance 'test-6-ps)))

#+END_SRC

#+RESULTS:
: IN Main method
: IN visit-client-more-than-once
: IN Main method
: IN visit-each-client-at-least-once
: clients: (1 2 3 4 5 6 7 8)
: routes: ((6 2 3 5 4) (1) (7 8))
: repeated-client: 8
: routes-repeated-client: ((6 2 3 5 4) (1) (7 8 8))


***** TEST

#+BEGIN_SRC lisp :results output
  (progn

  (defclass test-7-description (begin-anywhere) ())

  (defclass test-7-ps (has-clients has-routes) ())

  (Generate-solution-by-condition (make-instance 'test-7-description) (make-instance 'basic-strategy) (make-instance 'test-7-ps)))

#+END_SRC

#+RESULTS:
: IN Main method
: IN begin-anywhere
: IN Main method
: IN visit-each-client-at-least-once
: clients: (1 2 3 4 5 6 7 8 9 10 11)
: routes: ((2 10 8 5 9 7) (4 6) (3 1) (11))
: routes that begin anywhere: ((2 10 8 5 9 7) (4 6) (0 3 1) (0 11))


***** TEST

#+BEGIN_SRC lisp :results output
  (progn

  (defclass test-7-description (end-anywhere) ())

  (defclass test-7-ps (has-clients has-routes) ())

  (Generate-solution-by-condition (make-instance 'test-7-description) (make-instance 'basic-strategy) (make-instance 'test-7-ps)))

#+END_SRC

#+RESULTS:
: IN Main method
: IN  end-anywhere
: IN Main method
: IN visit-each-client-at-least-once
: clients: (1 2 3 4 5 6 7)
: routes: ((1 6 2 3) (5 4) (7))
: routes that end anywhere: ((1 6 2 3 0) (5 4) (7))


***** TEST

#+BEGIN_SRC lisp :results output
  (progn

  (defclass test-8-description (overload-vehicles) ())

  (defclass test-8-ps (has-clients has-routes has-demand has-capacity) ())

  (Generate-solution-by-condition (make-instance 'test-8-description) (make-instance 'basic-strategy) (make-instance 'test-8-ps)))

#+END_SRC

#+RESULTS:
#+begin_example
IN Main method
IN overload-vehicle
IN Main method
IN visit-each-client-at-least-once
clients: (1 2)
routes: ((2 1))
demands: (0 1 86)
values: (87)
max value: 87
capacity: 25
#+end_example
